programming-memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>プログラミングの基礎固めのために</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="プログラミングの基礎固めのために"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-14 04:50:00 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="./org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">プログラミングの基礎固めのために</h1>


<meta content='no-cache' http-equiv='Pragma' />


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 傾向</a></li>
<li><a href="#sec-2">2 数学的な考え方</a>
<ul>
<li><a href="#sec-2-1">2.1 資料</a></li>
<li><a href="#sec-2-2">2.2 条件分岐と論理</a></li>
<li><a href="#sec-2-3">2.3 繰り返しと数学的帰納法</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 0のこと</a></li>
<li><a href="#sec-2-3-2">2.3.2 命題論理</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 アルゴリズムのこと</a>
<ul>
<li><a href="#sec-3-1">3.1 資料</a></li>
<li><a href="#sec-3-2">3.2 全探索</a></li>
<li><a href="#sec-3-3">3.3 貪欲法</a></li>
<li><a href="#sec-3-4">3.4 動的計画法</a></li>
<li><a href="#sec-3-5">3.5 データ構造</a></li>
<li><a href="#sec-3-6">3.6 グラフ</a></li>
<li><a href="#sec-3-7">3.7 数学的な問題</a></li>
<li><a href="#sec-3-8">3.8 ２分探索</a></li>
<li><a href="#sec-3-9">3.9 ネットワークフロー</a></li>
<li><a href="#sec-3-10">3.10 ゲーム</a></li>
</ul>
</li>
<li><a href="#sec-4">4 AOJとか</a>
<ul>
<li><a href="#sec-4-1">4.1 リンク</a></li>
<li><a href="#sec-4-2">4.2 0010</a></li>
<li><a href="#sec-4-3">4.3 0012</a></li>
</ul>
</li>
<li><a href="#sec-5">5 線形代数の知識が必要な問題を解くために</a>
<ul>
<li><a href="#sec-5-1">5.1 ベクトル</a></li>
<li><a href="#sec-5-2">5.2 行列</a></li>
<li><a href="#sec-5-3">5.3 行列式</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Githubチュートリアル</a></li>
<li><a href="#sec-7">7 Ocamlのプログラミング環境</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 傾向</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>私の傾向
</li>
</ul>

<p>とりあえず，幾何系の問題にはとても弱い．
ベクトル，行列といった基礎的な概念が理解できていない．
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 数学的な考え方</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 資料</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>プログラマの数学
</li>
</ul>

<p><a href="http://www.amazon.co.jp/dp/4797329734">http://www.amazon.co.jp/dp/4797329734</a>
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 条件分岐と論理</h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 繰り返しと数学的帰納法</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 0のこと</h4>
<div class="outline-text-4" id="text-2-3-1">

<ul>
<li>我々が普段一番よく使っているアラビア数字は位取り記数法によって数を表している．
</li>
<li>大きな問題を小さなまとまりに分けて問題を解く．
</li>
</ul>


</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> 命題論理</h4>
<div class="outline-text-4" id="text-2-3-2">

<ul>
<li>命題: 正しいか正しくないかを判断できる文
<ul>
<li>命題は必ず真偽(true/false)のどちらかになる

</li>
</ul>

</li>
<li>一般化
</li>
</ul>

<blockquote>

<p>論理学で、さまざまな事物に共通する性質を抽象し、一つの概念にまとめること。
概括。
普遍化。
</p>
</blockquote>


<p>
大辞泉より
</p>
<ul>
<li>順列，組み合わせ
<ul>
<li>ダブリを意識する
</li>
<li>置換
<ul>
<li>n!
</li>
</ul>

</li>
<li>順列
<ul>
<li><sub>n</sub>P<sub>k</sub>
</li>
<li>n! / (n - k)!
</li>
</ul>

</li>
<li>組み合わせ
<ul>
<li>順序を考えて数えて，あとから重複度で割る
</li>
<li><sub>n</sub>C<sub>k</sub> = <sub>n</sub>P<sub>k</sub> / <sub>k</sub>P<sub>k</sub>
</li>
<li>(n! / (n - k)!) / k! = n! / (n - k)! * k!
</li>
</ul>

</li>
</ul>

</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> アルゴリズムのこと</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 資料</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>プログラミングコンテストチャレンジブック
</li>
</ul>

<p>秋葉 拓哉 (著), 岩田 陽一 (著), 北川 宜稔 (著) 
<a href="http://www.amazon.co.jp/dp/4839931992">http://www.amazon.co.jp/dp/4839931992</a>
</p><ul>
<li>各種アルゴリズムの C++ による実装
 <a href="http://www.prefield.com/algorithm/">http://www.prefield.com/algorithm/</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 全探索</h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 貪欲法</h3>
<div class="outline-text-3" id="text-3-3">

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 動的計画法</h3>
<div class="outline-text-3" id="text-3-4">

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> データ構造</h3>
<div class="outline-text-3" id="text-3-5">

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> グラフ</h3>
<div class="outline-text-3" id="text-3-6">

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 数学的な問題</h3>
<div class="outline-text-3" id="text-3-7">

</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> ２分探索</h3>
<div class="outline-text-3" id="text-3-8">

</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> ネットワークフロー</h3>
<div class="outline-text-3" id="text-3-9">

</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> ゲーム</h3>
<div class="outline-text-3" id="text-3-10">


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> AOJとか</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> リンク</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li><a href="http://judge.u-aizu.ac.jp/onlinejudge/">http://judge.u-aizu.ac.jp/onlinejudge/</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 0010</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>三角形の外接円の中心
</li>
</ul>

<p><a href="http://www.h6.dion.ne.jp/~jpe02_tn/ki-5.html">http://www.h6.dion.ne.jp/~jpe02_tn/ki-5.html</a>
<a href="https://github.com/tatesuke/tatesuke-aoj/wiki/0012">https://github.com/tatesuke/tatesuke-aoj/wiki/0012</a>
</p>
<ul>
<li>C++の書式
</li>
</ul>

<p><a href="http://www.math.meiji.ac.jp/~mk/labo/studying-C/Programing-in-C/node244.html">http://www.math.meiji.ac.jp/~mk/labo/studying-C/Programing-in-C/node244.html</a>
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 0012</h3>
<div class="outline-text-3" id="text-4-3">


<p>   
However, members of the committee are so busy maniacally developing 
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 線形代数の知識が必要な問題を解くために</h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>高専の頃に学んだ内容が頭から吹き飛んでいる
<ul>
<li>プログラミングに関係ある部分を復習しまとめている．

</li>
</ul>

</li>
<li>Ruby, Gnuplotなどを使って復習
</li>
</ul>



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> ベクトル</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>矢印，空間内の点
</li>
</ul>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 行列</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>空間から空間への写像
</li>
</ul>


</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 行列式</h3>
<div class="outline-text-3" id="text-5-3">


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Githubチュートリアル</h2>
<div class="outline-text-2" id="text-6">

<p><a href="http://try.github.com/levels/1/challenges/1">http://try.github.com/levels/1/challenges/1</a>
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Ocamlのプログラミング環境</h2>
<div class="outline-text-2" id="text-7">

<p><a href="http://www.i.kyushu-u.ac.jp/~bannai/ocaml-intro/install.html">http://www.i.kyushu-u.ac.jp/~bannai/ocaml-intro/install.html</a>
</p>
<p>
[C-x C-e]とか，[C-c C-r]が使える．
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-14 04:50:00 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
